var x = parseInt(prompt("Введите целое число в диапазоне от 0 до 9:"));
if (isNaN(x)) {
    alert("Ошибка! Нужно вводить только число!");
} else  if ((x > 9) || (x < 0)) {
    alert("Введенное число выходит за границы требуемого диапазона!");
} else if (x == 0) {
    alert("Число " + x + " - ноль");
} else if (x == 1) {
    alert("Число " + x + " - один");
} else if (x == 2) {
    alert("Число " + x + " - два");
} else if (x == 3) {
    alert("Число " + x + " - три");
} else if (x == 4) {
    alert("Число " + x + " - четыре");
} else if (x == 5) {
    alert("Число " + x + " - пять");
} else if (x == 6) {
    alert("Число " + x + " - шесть");
} else if (x == 7) {
    alert("Число " + x + " - семь");
} else if (x == 8) {
    alert("Число " + x + " - восемь");
} else {
    alert("Число " + x + " - девять");
}